# GetMaterialFillStyle

```pascal
FUNCTION GetMaterialFillStyle(materialHandle : HANDLE): LONGINT;
```

```python
def vs.GetMaterialFillStyle(materialHandle):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|materialHandle|HANDLE|   |

## Version
Availability: from Vectorworks 2021

## Category
* Object Attributes